#include <stdlib.h>
#include <stdio.h>
int main()
{
	int ** m = malloc(sizeof(int * ) * 3);		//이중 포인터에 (int 포인터크기 * 배열세로크기) 만큼 동적메모리 할당
												//배열의 세로	
	
	for(int i = 0; i < 3; i++)
	{
		m[i] = malloc(sizeof(int) * 4);			//(int 크기 * 배열가로크기) 만큼 동적 메모리 할당
	}											//배열의 가로
	
	m[0][0] = 1;
	m[2][0] = 5;
	m[2][3] = 2;
	
	printf("m[0][0] = %d\n", m[0][0]);
	printf("m[2][0] = %d\n", m[2][0]);
	printf("m[2][3] = %d\n", m[2][3]);
	
	for(int i=0;i<3;i++)						//세로 크기만큼 반복
	{
		free(m[i]);								//2차원 배열의 가로 공간 메모리 해제
	}
	
	free(m);									//2차원 배열의 세로 공간 메모리 해제
	
	return 0;
}


/*
  int **			    int *					int
--------- pointer to ----------- pointer to	-----------------------------------------
|	m	|---------->|	m[0]   |----------->| m[0][0] | m[0][1] | m[0][2] | m[0][3] |
---------			------------ 			-----------------------------------------
	  				|	m[1]   |			| m[1][0] | m[1][1] | m[1][2] | m[1][3] |
	  				------------			-----------------------------------------
	  				|	m[2]   |			| m[2][0] | m[2][1] | m[2][2] | m[2][3] |
	  				------------			-----------------------------------------
*/